#====================================================================================================================================================================================================
#1. Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
#====================================================================================================================================================================================================
# Пример:
# - 6 -> да
# - 7 -> да
# - 1 -> нет
#===============================

# day = int(input("Введите день недели: "))
# if day >=6 and day <= 7:
#     print("Yes")
# elif day >=1 and day <= 5: 
#     print("no")
# else:
#     print("Выход за пределы дней недели!")

#====================================================================================================================================================================================================
#2. Напишите программу для. проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.
#====================================================================================================================================================================================================

# x = int(input("Введите X: "))
# y = int(input("Введите y: "))
# z = int(input("Введите z: "))

# print((not (x or y or z)) == (not x and not y and not z))

#====================================================================================================================================================================================================
#3. Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).
#====================================================================================================================================================================================================
# Пример:
# - x=34; y=-30 -> 4
# - x=2; y=4-> 1
# - x=-34; y=-30 -> 3
#===============================
# x = int(input("Введите x: "))
# y = int(input("Введите y: "))

# if x == 0 or y == 0:
#     print("Номер четверти не определена!")
# elif x > 0 and y > 0:
#     print(f"x = {x}; y = {y} -> 1")
# elif x < 0 and y > 0:
#     print(f"x = {x}; y = {y} -> 2")
# elif x < 0 and y < 0:
#     print(f"x = {x}; y = {y} -> 3")
# else:
#     print(f"x = {x}; y = {y} -> 4")


#====================================================================================================================================================================================================
#4. Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).
#====================================================================================================================================================================================================

# num = int(input("Введите номер четверти: "))

# if num == 1:
#     print("x > 0; y > 0")
# elif num == 2:
#     print("x < 0; y > 0")
# elif num == 3:
#     print("x < 0; y < 0")
# elif num == 4:
#     print("x > 0; y < 0")
# else:
#     print("Вы вышли за пределы четверти!")


#====================================================================================================================================================================================================
#5. Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
#====================================================================================================================================================================================================
# Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21
#===============================

# import math  

# x1 = int(input("Введите координату X первой точки A: "))
# y1 = int(input("Введите координату y первой точки A: "))
# x2 = int(input("Введите координату X второй точки B: "))
# y2 = int(input("Введите координату y второй точки B: "))

# print(f"Расстояние между точками: {round(float(math.sqrt((x2 - x1)*(x2 - x1) + (y2 - y1)*(y2 - y1))), 3)}")


